Frank-Bemelman/HaniMandl-for-ESP32DEV/src/menu.cpp
#include <Arduino.h>

#include <ESP32Servo.h>             
#include <Arduino_GFX_Library.h>    
#include <TFT_eSPI.h>               // more versatile display library
#include <Preferences.h>            // eeprom acces library
#include <nvs_flash.h>              /* aus dem BSP von expressif, wird verfügbar wenn das richtige Board ausgewählt ist */

#include "hani.h"
#include <HX711_ADC.h>

extern void setPreferences(void);
extern int GetCurrent(int count);
extern void buzzer(byte type);
extern void initRotaries( int rotary_mode, int rotary_value, int rotary_min, int rotary_max, int rotary_step );
extern int getRotariesValue( int rotary_mode );
extern void setRotariesValue( int rotary_mode, int rotary_value );
extern void setupTara();              // Tara 
extern void setupCalibration();       // Kalibrieren
extern void setupFuellmenge();        // Füllmenge               
extern void setupAutomatik();         // Autostart/Autokorrektur konfigurieren 
extern void setupServoWinkel();       // Servostellungen Minimum, Maximum und Feindosierung
extern void setupParameter();         // Sonstige Einstellungen
extern void setupCounter();           // Zählwerk
extern void setupTripCounter();       // Zählwerk Trip
extern void setupINA219();            // INA219 Setup    
extern void setupClearPrefs();        // EEPROM löschen


extern int alarm_overcurrent;          // Alarmflag wen der Servo zuwiel Strom zieht
extern int current_mA;                     // Strom welcher der Servo zieht
extern int current_servo;              // 0 = INA219 wird ignoriert, 1-1000 = erlaubter Maximalstrom vom Servo in mA
extern int offset_winkel;              // Offset in Grad vom Schlieswinkel wen der Servo Überstrom hatte (max +3Grad vom eingestelten Winkel min)
extern int winkel_min;                 // konfigurierbar im Setup
extern Servo servo;
extern int inawatchdog;                // 0 = aus, 1 = ein / wird benötigt um INA messung auszusetzen
extern Arduino_GFX *gfx;
//Color Scheme für den TFT Display
extern unsigned long  COLOR_BACKGROUND;
extern unsigned long  COLOR_TEXT;
extern unsigned long  COLOR_MENU_POS1;
extern unsigned long  COLOR_MENU_POS2;
extern unsigned long  COLOR_MENU_POS3;
extern unsigned long  COLOR_MENU_POS4;
extern unsigned long  COLOR_MARKER;
//Variablen für TFT update
extern bool no_ina;
extern int gewicht_alt;
extern int winkel_min_alt;
extern int pos_alt;
extern int winkel_ist_alt;
extern int tara_alt;
extern int current_mA_alt;
extern int servo_aktiv_alt;
extern int auto_aktiv_alt;
extern int glas_alt;
extern int korr_alt;
extern int rotary_select_alt;
extern int autokorr_gr_alt;
// Allgemeine Variablen
extern int i;                              // allgemeine Zählvariable
extern int pos;                            // aktuelle Position des Poti bzw. Rotary 
extern int gewicht;                        // aktuelles Gewicht
extern int tara;                           // Tara für das ausgewählte Glas, für Automatikmodus
extern int tara_glas;                      // Tara für das aktuelle Glas, falls Glasgewicht abweicht
extern long gewicht_leer;                  // Gewicht der leeren Waage
extern float faktor;                       // Skalierungsfaktor für Werte der Waage
extern int fmenge;                         // ausgewählte Füllmenge
extern int fmenge_index;                   // Index in gläser[]
extern int korrektur;                      // Korrekturwert für Abfüllmenge
extern int autostart;                      // Vollautomatik ein/aus
extern int autokorrektur;                  // Autokorrektur ein/aus
extern int kulanz_gr;                      // gewollte Überfüllung im Autokorrekturmodus in Gramm

extern int progressbar;                // Variable für den Progressbar
extern char ausgabe[];                   // Fontsize 12 = 13 Zeichen maximal in einer Zeile
extern int modus;                     // Bei Modus-Wechsel den Servo auf Minimum fahren
extern int auto_aktiv;                 // Für Automatikmodus - System ein/aus?
extern int winkel;                         // aktueller Servo-Winkel
extern int winkel_min;                 // konfigurierbar im Setup
extern int winkel_max;                // konfigurierbar im Setup
extern int winkel_fein;               // konfigurierbar im Setup
extern float fein_dosier_gewicht;     // float wegen Berechnung des Schliesswinkels
extern int servo_aktiv;                // Servo aktivieren ja/nein
extern const char *GlasTypArray[];
extern int StringLenght(String a);
extern int rotary_select;
extern int show_current;               // 0 = aus, 1 = ein / Zeige den Strom an auch wenn der INA ignoriert wird
extern bool bINA219_installed;   
extern bool gezaehlt;               // Kud Zähl-Flag
extern HX711_ADC LoadCell;
extern int glastoleranz;              // Gewicht für autostart darf um +-20g schwanken, insgesamt also 40g!
extern int kali_gewicht; 

extern Preferences preferences;

extern JarType JarTypes[];
extern JarParameter Jars[];

extern int SysParams[];


extern void SetupMyDisplay(void);
extern void TFT_line_print(int line, const char *content);
extern void TFT_line_color(int line, int textcolor, int backgroundcolor);
extern void TFT_line_blink(int line, bool blink); 
extern void SelectMenu(int menu); 
extern bool IsPulsed(bool *button);

extern volatile bool deb_start_button;
extern volatile bool deb_stop_button;
extern volatile bool deb_encoder_button;
extern volatile bool deb_setup_switch;
extern volatile bool deb_auto_switch;
extern volatile bool deb_manual_switch;

extern bool bStartButtonPulsed;
extern bool bStopButtonPulsed;
extern bool bEncoderButtonPulsed;
extern bool bSetupSwitchPulsed;
extern bool bAutoSwitchPulsed;
extern bool bManualSwitchPulsed;


extern int start_button_f;
extern int stop_button_f;
extern int encoder_button_f;
extern int setup_switch_f;
extern int auto_switch_f;
extern int manual_switch_f;

extern TFT_eSPI tft;

extern int LastMenu;
extern int CurrentMenu;
extern int EditMenu;

