Frank-Bemelman/HaniMandl-for-ESP32DEV/src/menu.cpp
extern Menu BigMenu[];
extern int ActLcdMode;
extern int NewWeight;
extern int OldWeight;


#define Y_SERVODATA 34

// local functions
void CalibrateScale(void);
void ParameterMenu(int menu);
void GetTextForMenuLine(char* text, int menu, int line); // build a single line with text and parameters 
void SetDefaultParameters(void);
void SaveParameters(void);
void LoadParameters(void);


 
void Menu(void)
{ static int state = 0;
  static int newmenu;
  static int editmode = 0;
  char text[64];

  if(modus != MODE_SETUPMENU)state = 0; // new arrival

  switch(state)
  { case 0:
      // Select the right menu background stuff
      SelectMenu(HANI_MENU);
      modus = MODE_SETUPMENU;
      CurrentMenu = LastMenu;
      TFT_line_print(0, BigMenu[CurrentMenu].menuname);
      TFT_line_print(1, BigMenu[CurrentMenu].menuheader);
      sprintf(text, "%02d*%02d", LastMenu, SETUP_ENDOFMENU); 
//      TFT_line_print(5, "Navigate And Select");
      TFT_line_print(5, text);
      TFT_line_color(5, TFT_WHITE, TFT_BLACK);
//      TFT_line_blink(5, true);
      initRotaries(SW_MENU, LastMenu, SETUP_STARTOFMENU, SETUP_ENDOFMENU, 1);
      state++;
      return;
    case 1: // wandering in top menu selection
      rotary_select = SW_MENU;
      CurrentMenu = getRotariesValue(SW_MENU);
      if(CurrentMenu!=LastMenu)
      { LastMenu = CurrentMenu;
        TFT_line_print(0, BigMenu[CurrentMenu].menuname);
        TFT_line_print(1, BigMenu[CurrentMenu].menuheader);
        sprintf(text, "%02d*%02d", LastMenu, SETUP_ENDOFMENU);
        TFT_line_print(5, text);
      }

      break;
    default:
      break;
  }  

  if(encoder_button_f == deb_encoder_button) // state change 
  { encoder_button_f = 1234;  
    if(deb_encoder_button)  // pressed?)
    { editmode = true;
      TFT_line_print(1, "");
      TFT_line_print(5, "");
      delay(100); // give some time to background task for display update

      // use the old menus
      switch(LastMenu)
      { case 0:   
          //setupTara();              // Tara 
          ParameterMenu(0);
          break;
        case 1:   
          CalibrateScale();         // new menu
          setPreferences();
          break;
        case 2:   
//          setupFuellmenge();        // Füllmenge               
          ParameterMenu(2);
          break;  
        case 3:   
//          setupAutomatik();         // Autostart/Autokorrektur konfigurieren 
          ParameterMenu(3);
          break;  
        case 4:   
//          setupServoWinkel();       // Servostellungen Minimum, Maximum und Feindosierung
          ParameterMenu(4);
          break;  
        case 5:   
//          setupParameter();         // Sonstige Einstellungen
          ParameterMenu(5);
          break;  
        case 6:   
//          setupCounter();           // Zählwerk
          ParameterMenu(6);
          break;  
        case 7:   
//          setupTripCounter();       // Zählwerk Trip
          ParameterMenu(7);
          break;  
        case 8:   
          setupINA219();            // INA219 Setup    
          break;  
        case 9:   
//          setupClearPrefs();        // EEPROM löschen
          ParameterMenu(9);
          break;  
        case 10:   
          ParameterMenu(10);  // languages
          break;  
        default:   
           break;  
       }
       editmode = false;
       ActLcdMode = 999; // force new display build
       CurrentMenu = 999; 
       modus = -1;
    } 
  }     
}


void CalibrateScale(void)
 { float gewicht_raw;
   int state = 0;
   int gewicht_alt = -9999;
   int kali_gewicht_old = -9999;
   unsigned long now;

   OldWeight = 0;
   while(true)
   { if(state==7) // waiting loop, nice to display weight 
     { NewWeight = round(LoadCell.getData());
     }

    
     if(deb_stop_button || !deb_setup_switch)
     { if(state<5)
       { LoadCell.setCalFactor(faktor); 
       }
       state = 8; // Quick exit
     }
     switch(state)
     { case 0:
         TFT_line_color(4, TFT_BLACK, TFT_RED);
         TFT_line_print(4, "Empty Scale Please!");
         TFT_line_blink(4, true);
         TFT_line_print(5, "Continue When Done");
         if(!deb_encoder_button) state++; // proceed when button released
         break;
       case 1: // wait for button
         if(deb_encoder_button)  // pressed?)
         { LoadCell.setCalFactor(1);
           LoadCell.tare();
           delay(500);
           state++;
         }
         break;
       case 2: // wait for button released
         if(!deb_encoder_button)  // pressed?)
         { state++;
         }
         break;  
       case 3: // wait for button released
         TFT_line_color(3, TFT_BLACK, TFT_RED);
         TFT_line_print(3, "Place A Known Weight");
         TFT_line_blink(3, true);
         TFT_line_print(5, "Continue When Done");
         initRotaries(SW_MENU, kali_gewicht, 100, 9999, 1); 
         state++;
       case 4: // let user adjust the known weight
         kali_gewicht = getRotariesValue(SW_MENU);
         if (kali_gewicht != kali_gewicht_old)
         {  sprintf(ausgabe, "Calibrate As %d gram", kali_gewicht);
            TFT_line_print(4, ausgabe);
         }
         if(deb_encoder_button)  // pressed?)
         { state++; 
         }
         break;  
       case 5:
         gewicht_raw = round(LoadCell.getData());
         faktor = gewicht_raw / kali_gewicht;
         LoadCell.setCalFactor(faktor); 
         gewicht_leer = LoadCell.getTareOffset(); 
         TFT_line_print(3, "");
         TFT_line_print(4, "");
         TFT_line_print(5, "Thank You!");
         TFT_line_blink(5, true);
         EditMenu = CurrentMenu;  // bepaalt of gewicht geprint wordt
         state++;
         break;

       case 6:
         state++;
         now = millis(); 
         break;  
       
       case 7:
         if((millis()-now)>2500)state++;
         break;  
       case 8:
         EditMenu = 0;
         return;
         break;  
     }
     delay(10); 
   
