Frank-Bemelman/HaniMandl-for-ESP32DEV/src/menu.cpp
   } 

}



void ParameterMenu(int menu)
 { int state = 0;
   unsigned long now;
   int scrollpos = 0; // defines offset
   int editline = 0; // line to be changed
   int editline_old;
   int n;
   int menuitems;
   char text[128];
   int restorevalue;
   int restorevalue2;
   state = 0;
   int newvalue;
   int column; 

   IsPulsed(&bStartButtonPulsed); // reset the button flag
   IsPulsed(&bStopButtonPulsed); // reset the button flag
   IsPulsed(&bEncoderButtonPulsed); // reset the button flag
   IsPulsed(&bSetupSwitchPulsed); // reset the button flag
   IsPulsed(&bAutoSwitchPulsed); // reset the button flag
   IsPulsed(&bManualSwitchPulsed); // reset the button flag

   // first count menuitems
   menuitems=0;
   for(n=0;n<6;n++) // max 6 lines in menu
   { if(BigMenu[menu].line[n].targetidx != NOT_USED)menuitems++;
   }
   column = 1; // work on the first column

   while(true)
   { if(IsPulsed(&bStopButtonPulsed) || !deb_setup_switch)
     { if(state==4) // stop button and setup switch works as cancel while fiddling with the value
       { TFT_line_blink(editline-scrollpos+1,false); // unblink
         if(BigMenu[menu].line[editline].parmtype == SET_TARRA)TFT_line_color(editline-scrollpos+1, TFT_WHITE, TFT_BLACK); // back to normal
         if(BigMenu[menu].line[editline].parmtype == SET_JAR_PRESET)
         { Jars[editline].Gewicht = restorevalue;
           Jars[editline].GlasTyp = restorevalue2;
         }
         else if(BigMenu[menu].line[editline].parmtype == SET_TO_ZERO)
         { Jars[editline].Count = restorevalue;
         }
         else
         { SysParams[BigMenu[menu].line[editline].targetidx] = restorevalue;
         }
         GetTextForMenuLine(text, menu, editline);
         TFT_line_print(editline-scrollpos+1, text);
         initRotaries(SW_MENU, editline, 0, menuitems, 1);
         state = 1;  
       }
       else return;  
     }
    
     switch(state)
     { case 0: // (re)print content
         for(n=0;n<4;n++) // max 4 lines to print
         { if(BigMenu[menu].line[n+scrollpos].targetidx != NOT_USED)
           { GetTextForMenuLine(text, menu, n+scrollpos);
             TFT_line_print(n+1, text);
             if(editline != (n+scrollpos))TFT_line_color(n+1, TFT_WHITE, TFT_DARKGREY);
             else TFT_line_color(n+1, TFT_WHITE, TFT_BLACK); // display as selected
           }  
         }
         TFT_line_print(5, BigMenu[menu].bottomline);
         if(editline==menuitems)
         { TFT_line_color(5, TFT_WHITE, TFT_BLACK);
           TFT_line_blink(5, true);
         }
         else
         { TFT_line_color(5, TFT_WHITE, TFT_DARKGREY); 
         }
         initRotaries(SW_MENU, editline, 0, menuitems, 1);
         editline_old = editline; 
         state++; 
         break;

       case 1: 
         state++;
         break;         

       case 2: // wander through the available menu items
         editline = getRotariesValue(SW_MENU);
         if(editline!=editline_old)
         { if(editline+scrollpos>3) // menuitems = 6, editline = 0-6 (7 values)
           { if(editline<menuitems) // not on the exit line
             { scrollpos = editline-3;
             }
           }
           else
           { if(editline<scrollpos)
             { scrollpos = editline;
             } 
           }
           state = 0;
         }
         else
         { if(IsPulsed(&bEncoderButtonPulsed))  // choice is made
           { if(editline==menuitems) // on the exit line
             { state = 5; 
             }
             else
             { TFT_line_blink(editline-scrollpos+1, true);
               // setup encoder for this edit range
               if(BigMenu[menu].line[editline].parmtype==SET_JAR_PRESET)
               { restorevalue=Jars[editline].Gewicht;
                 restorevalue2=Jars[editline].GlasTyp;
                 initRotaries(SW_MENU, Jars[editline].Gewicht, BigMenu[menu].line[editline].min, BigMenu[menu].line[editline].max, 1);
               }
               else if(BigMenu[menu].line[editline].parmtype==SET_TO_ZERO)
               {  restorevalue = Jars[editline].Count;
                  initRotaries(SW_MENU, 0, BigMenu[menu].line[editline].min, BigMenu[menu].line[editline].max, 1);
               }
               else if(BigMenu[menu].line[editline].parmtype==SET_TRIPCOUNT)
               {  restorevalue = Jars[editline].TripCount;
                  initRotaries(SW_MENU, Jars[editline].TripCount, BigMenu[menu].line[editline].min, BigMenu[menu].line[editline].max, 1);
               }
               else
               { restorevalue = SysParams[BigMenu[menu].line[editline].targetidx];
                 initRotaries(SW_MENU, SysParams[BigMenu[menu].line[editline].targetidx], BigMenu[menu].line[editline].min, BigMenu[menu].line[editline].max, 1);
               }  
               state++;
             }  
           }
         }   
         break;

       case 3: // wait for button released
         state++;
         break;  
       case 4: // change the value with the rotary
         newvalue = getRotariesValue(SW_MENU);

         if(BigMenu[menu].line[editline].parmtype == SET_TARRA)
         { newvalue = round(LoadCell.getData());
           if (newvalue<10)TFT_line_color(editline-scrollpos+1, TFT_RED, TFT_BLACK);
           else TFT_line_color(editline-scrollpos+1, TFT_GREEN, TFT_BLACK);
         }
         else if(BigMenu[menu].line[editline].parmtype == SET_DEGREES)
         { if(SysParams[LIVESETUP])SERVO_WRITE(newvalue);
         }
         


         if(editline<menuitems) // we have a target
         { if(BigMenu[menu].line[editline].parmtype==SET_JAR_PRESET) // different treatment of jar presets
           { if(column==1)
             { if(newvalue!=Jars[editline].Gewicht)
               { Jars[editline].Gewicht = newvalue;
                 GetTextForMenuLine(text, menu, editline);
                 TFT_line_print(editline-scrollpos+1, text);
                 TFT_line_blink(editline-scrollpos+1, true);
               }
             }
             else // 2nd column
             { if(newvalue!=Jars[editline].GlasTyp)
               { Jars[editline].GlasTyp = newvalue;
                 GetTextForMenuLine(text, menu, editline);
                 TFT_line_print(editline-scrollpos+1, text);
                 TFT_line_blink(editline-scrollpos+1, true);
               }
             }
           }
           else if (BigMenu[menu].line[editline].parmtype==SET_TO_ZERO)
           { if(newvalue!=Jars[editline].Count)
              {Jars[editline].Count = newvalue;
               GetTextForMenuLine(text, menu, editline);
               TFT_line_print(editline-scrollpos+1, text);
               TFT_line_blink(editline-scrollpos+1, true);
             }
           }
           else if (BigMenu[menu].line[editline].parmtype==SET_TARRA)
           { if(newvalue!=JarTypes[editline].tarra)
              {JarTypes[editline].tarra = newvalue;
               GetTextForMenuLine(text, menu, editline);
               TFT_line_print(editline-scrollpos+1, text);
               TFT_line_blink(editline-scrollpos+1, true);
             }
           }
           else if (BigMenu[menu].line[editline].parmtype==SET_TRIPCOUNT)
           { if(newvalue!=Jars[editline].TripCount)
              {Jars[editline].TripCount = newvalue;
               GetTextForMenuLine(text, menu, editline);
               TFT_line_print(editline-scrollpos+1, text);
               TFT_line_blink(editline-scrollpos+1, true);
             }
           }
           
           else if(newvalue!=SysParams[BigMenu[menu].line[editline].targetidx])
           { SysParams[BigMenu[menu].line[editline].targetidx] = newvalue;
             GetTextForMenuLine(text, menu, editline);
             TFT_line_print(editline-scrollpos+1, text);
             TFT_line_blink(editline-scrollpos+1, true);
           }
           if(IsPulsed(&bEncoderButtonPulsed))  // pressed?
           { if(column==BigMenu[menu].columns) // time to leave
             { TFT_line_blink(editline-scrollpos+1, false);
               if(BigMenu[menu].line[editline].parmtype == RESETPREFS)
               { preferences.begin("EEPROM", false);
                 preferences.clear();
                 preferences.end();
                 TFT_line_print(5, "Will Reboot Now!");
                 TFT_line_blink(5, true);
                 delay(2000);
                 ESP.restart();
               }
               if(BigMenu[menu].line[editline].parmtype == RESETEEPROM)
               { nvs_flash_erase();    // erase the NVS partition and...
                 nvs_flash_init();     // initialize the NVS partition.
                 //Da machen wir gerade einen restart
                 TFT_line_print(5, "Will Reboot Now!");
                 TFT_line_blink(5, true);
                 delay(2000);
                 ESP.restart();
               }
               if(BigMenu[menu].line[editline].parmtype == SET_TARRA)TFT_line_color(editline-scrollpos+1, TFT_WHITE, TFT_BLACK); // back to normal
               initRotaries(SW_MENU, editline, 0, menuitems, 1);
               column=1;  
               state=1;  
               TFT_line_print(5, "Saved!");
               TFT_line_blink(5, true);
               SaveParameters();
               delay(1000);
               TFT_line_print(5, BigMenu[menu].bottomline);
             }
             else
             { column++; 
               initRotaries(SW_MENU, Jars[editline].GlasTyp, 0, 5, 1); // 5 different jar styles
             }
           }
         }
//         sprintf(text, "targetval %d", SysParams[BigMenu[menu].line[editline].targetidx]);
//         TFT_line_print(0, text);
         break;
       case 5: 
         state++; 
         break;  
       case 6:
         TFT_line_print(5, "Thank You!");
         TFT_line_blink(5, true);
         SaveParameters();
         state++;
         break;

       case 7:
         state++;
         now = millis(); 
         break;  
       
       case 8:
         if((millis()-now)>1000)state++;
         break;  
       case 9:
         EditMenu = 0;
         return;
         break;  
     }
     delay(10); 
   
