Frank-Bemelman/HaniMandl-for-ESP32DEV/src/menu.cpp
   } 

}

void GetTextForMenuLine(char* text, int menu, int line)
{ int targetvalue;

  targetvalue = SysParams[BigMenu[menu].line[line].targetidx];
  
  switch(BigMenu[menu].line[line].parmtype)
  { case SET_JAR_PRESET:
      sprintf(text, "%dg - %s", Jars[line].Gewicht, JarTypes[Jars[line].GlasTyp].name);
      
      break;
    case SET_ON_OFF:
      sprintf(text, "%s %s", BigMenu[menu].line[line].name, (SysParams[BigMenu[menu].line[line].targetidx]==0) ? "Off" : "On");
      break;
    case SET_YES_NO:
      sprintf(text, "%s %s", BigMenu[menu].line[line].name, (SysParams[BigMenu[menu].line[line].targetidx]==0) ? "No" : "Yes");
      break;
    case SET_GRAMS:
      sprintf(text, "%s %dg", BigMenu[menu].line[line].name, targetvalue);
      break;
    case SET_INTEGER:
      sprintf(text, "%s %d", BigMenu[menu].line[line].name, targetvalue);
      break;
    case SET_DEGREES:
      sprintf(text, "%s %d°", BigMenu[menu].line[line].name, targetvalue);
      break;
    case SET_CURRENT:
      sprintf(text, "%smA", BigMenu[menu].line[line].name, targetvalue);
      break;
    case SET_CLICK:  
    case SET_LANGUAGE:
      sprintf(text, "%s", BigMenu[menu].line[line].name);
      break;
    case SET_TARRA:
      sprintf(text, "%s %dg", JarTypes[line].name, JarTypes[line].tarra);
      break;
    case SET_TO_ZERO:
      sprintf(text, "%dg %s %d", Jars[line].Gewicht, JarTypes[Jars[line].GlasTyp].name, Jars[line].Count);
      break;
    case SET_TRIPCOUNT:
      sprintf(text, "%d-%s %d", Jars[line].Gewicht, JarTypes[Jars[line].GlasTyp].name, Jars[line].TripCount);
      break; 
      break;
    default:
      break;
  }
}

// set default values
void SetDefaultParameters(void)
{ int menu;
  int line;
  for(menu=SETUP_STARTOFMENU; menu<SETUP_ENDOFMENU;menu++)
  { for(line=0;line<6;line++)
    { SysParams[BigMenu[menu].line[line].targetidx] = BigMenu[menu].line[line].value;
    }
  }
  SysParams[LANGUAGE] = 0; // default is English
  SysParams[MANUALTARRA] = 25;
}

void SaveParameters(void)
{ int parameteridx;
  char label[16];
  int n;
  Serial.println("Parameter Saving");
  preferences.begin("EEPROM", false);
  for(parameteridx=AUTO_START; parameteridx<LASTPARAMETER;parameteridx++)
  { sprintf(label, "%d", parameteridx);
    if( SysParams[parameteridx] != preferences.getUInt(label, -12345)) // check if new value
    { preferences.putUInt(label, SysParams[parameteridx]);
      Serial.print("Parameter saved - ");
      Serial.print(label);
      Serial.print(" = ");
      Serial.println(SysParams[parameteridx]);

    }
  }

  for(n=0;n<6;n++)
  { sprintf(label, "jar%d-gewicht", n);
    if(Jars[n].Gewicht != preferences.getUInt(label, -12345))
    { preferences.putUInt(label, Jars[n].Gewicht);
    }
    sprintf(label, "jar%d-glastyp", n);
    if(Jars[n].GlasTyp != preferences.getUInt(label, -12345))
    { preferences.putUInt(label, Jars[n].GlasTyp);
    }
    sprintf(label, "jar%d-tara", n);
    if(JarTypes[n].tarra != preferences.getUInt(label, -12345))
    { preferences.putUInt(label, JarTypes[n].tarra);
    }
    sprintf(label, "jar%d-tripcount", n);
    if(Jars[n].TripCount != preferences.getUInt(label, -12345))
    { preferences.putUInt(label, Jars[n].TripCount);
    }
    sprintf(label, "jar%d-count", n);
    if(Jars[n].Count != preferences.getUInt(label, -12345))
    { preferences.putUInt(label, Jars[n].Count);
    }
  }
  preferences.end();
}

void LoadParameters(void)
{ int parameteridx;
  int val;
  char label[16];
  int n;
  Serial.println("Parameter loading");
  preferences.begin("EEPROM", false);
  for(parameteridx=AUTO_START; parameteridx<LASTPARAMETER;parameteridx++)
  { sprintf(label, "%d", parameteridx);
    val = preferences.getUInt(label, -12345); // see if we have that
    if(val != -12345)
    { SysParams[parameteridx] = val;
      Serial.print("Parameter loaded - ");
      Serial.print(label);
      Serial.print(" = ");
      Serial.println(SysParams[parameteridx]);
    }
  }

    for(n=0;n<6;n++)
  { sprintf(label, "jar%d-gewicht", n);
    val = preferences.getUInt(label, -12345);
    if(val != -12345)Jars[n].Gewicht = val;
    Serial.print("Parameter loaded - ");
    Serial.print(label);
    Serial.print(" = ");
    Serial.println(val);

    sprintf(label, "jar%d-glastyp", n);
    val = preferences.getUInt(label, -12345);
    if(val != -12345)Jars[n].GlasTyp = val;
    Serial.print("Parameter loaded - ");
    Serial.print(label);
    Serial.print(" = ");
    Serial.println(val);

    sprintf(label, "jar%d-tara", n);
    val = preferences.getUInt(label, -12345);
    if(val != -12345)JarTypes[n].tarra = val;
    Serial.print("Parameter loaded - ");
    Serial.print(label);
    Serial.print(" = ");
    Serial.println(val);

    sprintf(label, "jar%d-tripcount", n);
    val = preferences.getUInt(label, -12345);
    if(val != -12345)Jars[n].TripCount = val;
    Serial.print("Parameter loaded - ");
    Serial.print(label);
    Serial.print(" = ");
    Serial.println(val);

    sprintf(label, "jar%d-count", n);
    val = preferences.getUInt(label, -12345);
    if(val != -12345)Jars[n].Count = val;
    Serial.print("Parameter loaded - ");
    Serial.print(label);
    Serial.print(" = ");
    Serial.println(val);

  }

  preferences.end();
}


// eof